package com.example.finbase

class PracticIndependentworkBase {
   var glava1and2 = listOf(
      "С помощью сайта Агентства по страхованию вкладов (www.asv.org.ru: раздел «Страхование вкладов») найдите ответы на следующие вопросы.\n" +
           "Как проверить, входит ли банк в ССВ?",
      "С какого момента вклад считается застрахованным?",
      "Распространяется ли страхование на текущие счета, используемые для расчётов по банковским (пластиковым) картам для получения зарплаты, пенсии или стипендии?",
      "Застрахованы ли в ССВ средства, которые гражданин разместил в микрофинансовой организации?")
   var glava3and4 = listOf(
      "Сергей Петрович Степанов решил положить 100 тыс. руб. на депозит в надёжный банк. Какой вклад ему выгоднее открыть на один год: с ежемесячной капитализацией процентов под 8% годовых или без капитализации со ставкой 9,4% годовых?",
      "Вы открыли вклад со ставкой 9% годовых сроком на полтора года с капитализацией каждые полгода. Какой доход вы получите в итоге? Запишите ответ в процентах с точностью до десятых.",
      "Вы открыли вклад со ставкой 11% годовых на три года с ежегодной капитализацией. Какой доход вы получите в итоге? Запишите ответ в процентах с точностью до десятых.")
   var glava5and6 = listOf("Найдите с помощью Интернета данные (например, в разделе «Статистика» на сайте ЦБ РФ), отражающие динамику рублёвых и валютных кредитов россиян в период с 2013 г. по настоящее время.\nКак изменилась структура кредитов в этот период?",
   "Чем можно объяснить данную динамику?")
   var glava7 = listOf(
      "Айгуль Каримовна – соучредитель фирмы ООО «Кирпич-трейд».\n" +
           "У неё есть следующие сбережения:\n" +
           "• вклад в размере 1 000 000 руб. в банке «Рубин», по которому начислены проценты 80 000 руб.;\n" +
           "• текущий счёт в размере 430 000 руб. в этом же банке;\n" +
           "• паи ПИФа, купленные в банке «Первый постиндустриальный\n" +
           "банк» за 120 000 руб., которые теперь стоят 180 000 руб.;\n" +
           "• вклад в банке «Солнце», удостоверенный именным сберегательным сертификатом, 80 000 руб.;\n" +
           "• пополняемый вклад в филиале банка «Солнце» в Болгарии –\n" +
           "100 000 руб.\n" +
           "Кроме того, на текущем счёте фирмы ООО «Кирпич-трейд»\n" +
           "в банке «Первый постиндустриальный банк» лежат 450 000 руб.\n" +
           "Какое возмещение сможет получить Айгуль Каримовна через\n" +
           "ССВ, если все три банка завтра разорятся?",
      "Карина Рафаэловна – писательница, а её муж Максим Викторович – нотариус. У них есть следующие сбережения:\n" +
           "• вклад в размере 850 000 руб. в банке «Электрон» на имя\n" +
           "Максима Викторовича;"+"\n• вклад в размере 600 000 руб. в филиале банка «Электрон»\n" +
           "в другом городе на имя Максима Викторовича;\n" +
           "• вклад в долларах США (эквивалент 200 000 руб.) в банке\n" +
           "«Электрон» на имя Карины Рафаэловны, по которому начислены проценты в сумме, эквивалентной 10 000 руб.;\n" +
           "• текущий личный счёт Максима Викторовича в банке «Имперский кредит» с балансом 310 000 руб.;\n" +
           "• текущий счёт Максима Викторовича в банке «Имперский\n" +
           "кредит» с балансом 140 000 руб., который он использует для\n" +
           "получения оплаты от клиентов за нотариальные услуги;\n" +
           "• паи ПИФа, купленные Кариной Рафаэловной в банке «Радость» за 120 000 руб., которые теперь стоят 50 000 руб.\n" +
           "Какое возмещение сможет получить семья Карины Рафаэловны и Максима Викторовича через ССВ, если все три банка завтра\n" +
           "разорятся?",
      "Сбережения ваших родителей составляют 600 000 руб. Каков будет их доход (или потери) в реальном выражении при уровне инфляции в 7% в год, если:\n" +
              "1) они хранят деньги в сейфе в течение двух лет;\n" +
              "2) они кладут деньги на депозит со ставкой 9% годовых без\n" +
              "капитализации сроком на два года;\n" +
              "3) они кладут деньги на полугодовой депозит со ставкой 8%\n" +
              "годовых, а через полгода (когда ставки в банках выросли)\n" +
              "делают новый вклад на полтора года под 10% годовых;\n" +
              "4) они покупают паи ПИФа с доходностью в первый год –4%,\n" +
              "а во второй год 19%?")
}