package com.example.finbase

class PracticTestsBase {

   val q_1and2 = listOf(
      "В утверждении ЦБ РФ может: \n1) принимать вклады у населения; \n2) выдавать кредиты населению; \n3) выдавать кредиты коммерческим банкам",
      "Подлежат страхованию через ССВ:",
      "Данные дебетовой карты, которые у вас не имеют права запрашивать при совершении покупок в Интернете, – это:",
      "Не является преимуществом использования большинства дебетовых карт:")
   val a_1and2 = listOf(
      "только 3",
      "текущие счета физических лиц",
      "ПИН-код",
      "безопасность")
   val o_1and2 = listOf(
      "только 1",
      "1 и 2",
      "2 и 3",
      "только 3",
      "текущие счета физических лиц",
      "счета юридических лиц, не являющихся субъектами малого и среднего предпринимательства",
      "счета и вклады в филиалах российских банков за границей",
      "сберегательные вклады физических лиц",
      "имя владельца латинскими буквами",
      "дата истечения срока действия карты",
      "CVV-код",
      "ПИН-код",
      "безопасность",
      "возможность оплаты покупок в Интернете",
      "более выгодный курс конвертации валют",
      "возможность занимать деньги у банка (от нескольких десятков до нескольких сотен тысяч рублей)")

   val q_3and4 = listOf(
      "В утверждении «К факторам, которые стоит учитывать при выборе банка для открытия вклада, относятся: 1) процентная ставка;\n" +
              "2) участие в ССВ; 3) возможность досрочного закрытия вклада с потерей процентов» верно:",
      "Банк предлагает вам разные варианты депозитных вкладов сроком на год под 9% годовых. Вариант, при котором вы получите\n" +
              "наибольший доход, – это вклад:",
      "Банк предлагает вам разные варианты депозитных вкладов сроком на два года под 8% годовых. Вариант, при котором вы получите наименьший доход, – это вклад:")
   val a_3and4 = listOf(
      "1 и 2",
      "с ежемесячной капитализацией",
      "без капитализации")
   val o_3and4 = listOf(
      "только 1",
      "1 и 2",
      "1 и 3",
      "1–3",
      "без капитализации",
      "с годовой капитализацией",
      "с ежеквартальной капитализацией",
      "с ежемесячной капитализацией",
      "без капитализации",
      "с ежегодной капитализацией",
      "с ежеквартальной капитализацией",
      "с ежемесячной капитализацией")

   val q_5and6 = listOf(
      "Обычно самую низкую ставку имеет:",
      "В утверждении «К факторам, которые стоит учитывать при выборе банка для взятия кредита, относятся: 1) процентная ставка;\n" +
              "2) известность банка; 3) срок погашения» верно:",
      "Не повышает ваши шансы на получение кредита:",
      "В утверждении «К организациям, которые могут выдавать кредиты физическим лицам, относятся: 1) ЦБ РФ; 2) коммерческие\n" +
              "банки; 3) микрофинансовые организации» верно:",
      "На эффективную процентную ставку по кредиту может оказывать влияние:",
      "В утверждении «Объектом ипотеки может стать: 1) автомобиль;\n" +
              "2) квартира или дом; 3) коммерческое помещение» верно:",
      "В утверждении «Согласно законодательству РФ вы имеете право: 1) на досрочное погашение кредита; 2) на досрочное закрытие\n" +
              "вклада; 3) на реструктуризацию и рефинансирование кредита»\n" +
              "верно:",
      "Ваша подруга хочет купить автомобиль в кредит. В банке она узнала, что обязательным условием кредита является полное страхование автомобиля от ущерба и угона (каско). Почему банк выдвигает такое условие?")
   val a_5and6 = listOf(
      "овердрафт по дебетовой карте",
      "1 и 3",
      "наличие других действующих кредитов на ваше имя",
      "1–3",
      "всё перечисленное (может быть включено в расчёт эффективной ставки)",
      "2 и 3",
      "1 и 3",
      "автомобиль является залогом, и, если он будет угнан, банк ничего не потеряет, так как получит страховую сумму")
   val o_5and6 = listOf(
      "ипотечный кредит",
      "кредит, полученный в микрофинансовой организации",
      "овердрафт по дебетовой карте",
      "потребительский кредит",
      "только 1",
      "1 и 2",
      "1 и 3",
      "1–3",
      "наличие залога",
      "наличие поручителя",
      "наличие других действующих кредитов на ваше имя",
      "подтверждение стабильного дохода",
      "только 1",
      "1 и 2",
      "2 и 3",
      "1–3",
      "только номинальная ставка, прописанная в контракте",
      "только комиссия банка",
      "только страхование жизни заёмщика",
      "всё перечисленное (может быть включено в расчёт эффективной ставки)",
      "только 1",
      "1 и 2",
      "2 и 3",
      "только 2",
      "только 1",
      "1 и 2",
      "1 и 3",
      "2 и 3",
      "банк заботится о безмятежной жизни вашей подруги",
      "страховая компания является поручителем по кредиту и, если подруга не сможет погасить кредит, страховая компания возместит банку потери",
      "если автомобиль будет застрахован, то подруга с большей вероятностью погасит кредит вовремя",
      "автомобиль является залогом, и, если он будет угнан, банк ничего не потеряет, так как получит страховую сумму",)

   val q_7 = listOf(
      "Денежные средства, вложенные в ПИФы:",
      "Обезличенный металлический счёт:",
      "Кредитная карта предоставляет доступ:",
      "Дополнительная комиссия с кредитной карты взимается:",
      "Законодательство Российской Федерации разрешает пользоваться кредитными картами лицам, достигшим:")
   val a_7 = listOf(
      "не входят в ССВ",
      "застрахован в ССВ",
      "к краткосрочным банковским кредитам",
      "за снятие наличных",
      "21 года")
   val o_7 = listOf(
      "не входят в ССВ",
      "всегда приносят больший доход, чем банковские депозиты",
      "в отличие от банковского вклада приносят нефиксированный доход",
      "входят в ССВ",
      "облагается НДС",
      "не облагается НДС",
      "не застрахован в ССВ",
      "застрахован в ССВ",
      "к вашим собственным деньгам на текущем счёте в банке",
      "к счёту, на который вы делаете ежемесячные взносы по" + "ипотеке или другому кредиту",
      "к краткосрочным банковским кредитам",
      "к долгосрочным банковским кредитам",
      "при зачислении на неё собственных средств владельца",
      "при оплате через Интернет",
      "при покупке товаров в магазине",
      "за снятие наличных",
      "14 лет",
      "16 лет",
      "18 лет",
      "21 года")

   var glava1and2 = listOf(q_1and2, a_1and2, o_1and2)
   var glava3and4 = listOf(q_3and4, a_3and4, o_3and4)
   var glava5and6 = listOf(q_5and6, a_5and6, o_5and6)
   var glava7 = listOf(q_7, a_7, o_7)
}